of-run/canal/canal2D/06-canal2Dowc-D19d12z19/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    leftWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    rightWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    outflow
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    topWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    internalWalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
