of-run/canal/canal2D/06-canal2Dowc-D19d12z19/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0) //0
    (440 0 0)  //1
    (0 75 0) //2  
    (440 75 0) //3
    (1699 75 0) //4
    (1729.2 75 0) //5
    (1748.8 75 0) //6
    (1779 75 0) //7
    (0 325 0) //8
    (440 325 0) //9
    (1699 325 0) //10    
    (1729.2 325 0) //11
    (1748.8 325 0)  //12
    (1779 325 0) //13  
	(1729.2 641 0) //14
	(1748.8 641 0) //15
	(0 0 19.6) //16
    (440 0 19.6) //17 
    (0 75 19.6) //18  
    (440 75 19.6) //19
    (1699 75 19.6) //20
    (1729.2 75 19.6) //21
    (1748.8 75 19.6) //22
    (1779 75 19.6) //23
    (0 325 19.6) //24
    (440 325 19.6) //25
    (1699 325 19.6) //26    
    (1729.2 325 19.6) //27
    (1748.8 325 19.6)  //28
    (1779 325 19.6) //29
	(1729.2 641 19.6) //30
	(1748.8 641 19.6) //31	
	
);

blocks
(
    hex (0 1 3 2 16 17 19 18) (220 38 1) simpleGrading (1 1 1)
    hex (2 3 9 8 18 19 25 24) (220 125 1) simpleGrading (1 1 1)
    hex (3 4 10 9 19 20 26 25) (630 125 1) simpleGrading (1 1 1)
    hex (4 5 11 10 20 21 27 26) (15 125 1) simpleGrading (1 1 1)
    hex (5 6 12 11 21 22 28 27) (10 125 1) simpleGrading (1 1 1)
    hex (6 7 13 12 22 23 29 28) (15 125 1) simpleGrading (1 1 1)
hex (11 12 15 14 27 28 31 30) (10 158 1) simpleGrading (1 1 1)
                                                                                                                                                                                                                                                                                             
);

edges
(
);

boundary
(
	leftWall
    {
        type wall;
        faces
        (
            (0 16 18 2)
            (2 18 24 8)
			(11 27 30 14)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (13 29 23 7)
			(15 31 28 12)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 3 19 17)
            (3 4 20 19)
	    	(4 5 21 20)
            (5 6 22 21)
	    	(6 7 23 22)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 24 25 9)
            (9 25 26 10)
			
        );
    }
    outflow
    {
        type patch;
        faces
        (
            (14 30 31 15)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (10 26 27 11)
            (12 28 29 13)
        );
    }
    internalWalls
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
